package day0309;
// 학생 관리 프로그램
// 5명의 학생을 관리하는 프로그램을 작성하시오.
// 단, 모두 변수로 만드는 것이 아니라
// 번호 배열, 이름 배열, 국어점수 배열, 영어점수 배열, 수학점수 배열
// 로 만들어서
// 각 배열의 같은 인덱스는 같은 학생의 정보가 될수 있도록 하시오.
// 또한 메뉴를 만들어
// 입력, 출력, 종료를 분리하고
// 입력 시에는 0번, 1번, 2번... 순을 들어갈 수 있게 만드시오.
// 입력시에 잘못된 점수는 입력되지 않도록 만들어 주세요.

// 심화단계: 출력시, 만약 입력 학생이 없으면 "입력된 학생이 없습니다"라고 출력되고
//      입력된 학생이 존재할 시에는 입력된 학생들만 출력 되고 아직 입력 되지 않은 칸의 정보는
//      출력되지 않도록 프로그램을 작성하시오.

public class GreadBook01 {
    public static void main(String[] args) {
        
        
    }
}
